In [3]:
import pandas as pd
ufo=pd.read_csv('http://bit.ly/uforeports')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
ufo.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

In [5]:
ufo.Time.str.slice(9,11)

0        22
1         2
2         1
3        13
4         1
         ..
18236    0
18237    0
18238    0
18239    0
18240    0
Name: Time, Length: 18241, dtype: object

In [6]:
ufo.Time.str.slice(-5,-3)

0        22
1        20
2        14
3        13
4        19
         ..
18236    23
18237    23
18238    23
18239    23
18240    23
Name: Time, Length: 18241, dtype: object

In [7]:
ufo.Time.str.slice(-5,-3).astype(int)

0        22
1        20
2        14
3        13
4        19
         ..
18236    23
18237    23
18238    23
18239    23
18240    23
Name: Time, Length: 18241, dtype: int32

In [8]:
ufo['Time']=pd.to_datetime(ufo.Time)
ufo.Time #date time format

0       1930-06-01 22:00:00
1       1930-06-30 20:00:00
2       1931-02-15 14:00:00
3       1931-06-01 13:00:00
4       1933-04-18 19:00:00
                ...
18236   2000-12-31 23:00:00
18237   2000-12-31 23:00:00
18238   2000-12-31 23:45:00
18239   2000-12-31 23:45:00
18240   2000-12-31 23:59:00
Name: Time, Length: 18241, dtype: datetime64[ns]

In [9]:
ufo.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
dtype: object

In [10]:
ufo.Time.dt.hour

0        22
1        20
2        14
3        13
4        19
         ..
18236    23
18237    23
18238    23
18239    23
18240    23
Name: Time, Length: 18241, dtype: int64

In [11]:
ufo.Time.dt.weekday_name

0         Sunday
1         Monday
2         Sunday
3         Monday
4        Tuesday
          ...
18236     Sunday
18237     Sunday
18238     Sunday
18239     Sunday
18240     Sunday
Name: Time, Length: 18241, dtype: object

In [12]:
ufo.Time.dt.dayofyear

0        152
1        181
2         46
3        152
4        108
        ...
18236    366
18237    366
18238    366
18239    366
18240    366
Name: Time, Length: 18241, dtype: int64

In [13]:
ufo.Time.dt.dayofyear.head()

0    152
1    181
2     46
3    152
4    108
Name: Time, dtype: int64

In [14]:
pd.to_datetime('12/24/1999')

Timestamp('1999-12-24 00:00:00')

In [15]:
ts=pd.to_datetime('12/24/1999')
ufo.loc[ufo.Time>=ts,:]

,City,Colors Reported,Shape Reported,State,Time
15545,Atlantic City area,NaN,LIGHT,NJ,1999-12-24 04:00:00
15546,Augusta,NaN,OVAL,MT,1999-12-24 07:45:00
15547,Miami,RED,CIRCLE,FL,1999-12-24 21:00:00
15548,Youngstown,NaN,TRIANGLE,OH,1999-12-24 23:24:00
15549,Milton,NaN,TRIANGLE,TN,1999-12-24 23:55:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00

In [16]:
ufo.Time.max()

Timestamp('2000-12-31 23:59:00')

In [17]:
ufo.Time.max()-ufo.Time.min()

Timedelta('25781 days 01:59:00')

In [18]:
ufo.Time.min()

Timestamp('1930-06-01 22:00:00')

In [19]:
%matplotlib inline
ufo['Year']=ufo.Time.dt.year

In [20]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Year
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,1930
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,1930
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,1931
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,1931
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,1933

In [21]:
ufo.Year.value_counts()

1999    2774
2000    2635
1998    1743
1995    1344
1997    1237
        ...
1941       2
1936       2
1935       1
1934       1
1933       1
Name: Year, Length: 68, dtype: int64

In [22]:
ufo.Year.value_counts().sort_index()

1930       2
1931       2
1933       1
1934       1
1935       1
        ...
1996     851
1997    1237
1998    1743
1999    2774
2000    2635
Name: Year, Length: 68, dtype: int64

In [23]:
ufo.Year.value_counts()

1999    2774
2000    2635
1998    1743
1995    1344
1997    1237
        ...
1941       2
1936       2
1935       1
1934       1
1933       1
Name: Year, Length: 68, dtype: int64